app/views/pages/main/_dashboard.html.erb


        setTimeout(function(){
          markers.forEach(function(e){
            e.setMap(null);
          });
          fillMap(JSON.parse(hash.users_map), JSON.parse(hash.users))
          $.ajax({
            type: "POST",
            url: "<%= searched_users_pages_path %>",
            data: {
              users: JSON.parse(hash.users),
              sportSelected: $(".sport-box-map.selected").attr('value'),
              usersSelected: selected_users
            },
            dataType: "script",
            success: function (hash) {
            }
          });
        }, 500)
---
SELECT  "users".* FROM "users" INNER JOIN "user_sports" ON "users"."id" = "user_sports"."user_id" WHERE "user_sports"."sport_id" = ? AND "users"."id" IN (2, 3, 9) LIMIT ?  [["sport_id", 11], ["LIMIT", 5]]

    i = 0;
    markers_.forEach(function(e){
      var marker = new google.maps.Marker({
        position: e,
        map: map,
        title: users_[i].name,
        id: users_[i].id,
        icon: "<%= image_path('users/user-icon.png') %>"
      });
      i++;
      google.maps.event.addListener(marker, 'click', function(){
        userMapId = $(this).attr('id')
        $('.user-box').each(function(){
          if ($(this).attr('value') == userMapId){
            $(this).find('.user-selected-icon').fadeIn("slow");
            if ($(this).parent().parent().hasClass('selected')){
              $(this).removeClass('opacity')
            }
            setTimeout(function(){
              $('.user-selected-icon').fadeOut();
            },2000)
          }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]