app/views/aditional_data/_choose_disponibility.html.erb

SELECT "disponibilities".* FROM "disponibilities" WHERE "disponibilities"."user_id" = ? AND "disponibilities"."day" = ?  [["user_id", 12], ["day", 1]]
---
      <div class="disponibility
        <% if User.first.disponibilities.where(day: 1).present? %>

UPDATE "users" SET "gender" = ?, "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["gender", 0], ["age", 33], ["updated_at", "2018-04-17 01:43:46.595750"], ["id", 12]]
INSERT INTO "disponibilities" ("day", "afternoon", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["day", 1], ["afternoon", 1], ["user_id", 12], ["created_at", "2018-04-17 01:46:07.902041"], ["updated_at", "2018-04-17 01:46:07.902041"]]
---
  var disponibilities = {}
  $('#link-end').click(function(){
    var i = 1
    $('.day-text').each(function(){
      var disponibility = []
      day = $(this).html()
      $(this).parent().find('.disponibility').each(function(){
        if ($(this).hasClass("selected")){
          disponibility.push($(this).attr('value'))
          disponibilities[i] = disponibility
        }
      })
      i++
    })
    if (Object.keys(disponibilities).length == 0){
      alert("Debe seleccionar alguna disponibilidad")
    }else{
      $.ajax({
        type: "POST",
        url: '<%= chose_disponibility_aditional_data_path(current_user.id) %>',
        data: { disponibilities: disponibilities },
        dataType: "script",