app/views/aditional_data/_choose_sports.html.erb

SELECT "user_sports".* FROM "user_sports" WHERE "user_sports"."user_id" = ? AND "user_sports"."sport_id" = ?  [["user_id", 11], ["sport_id", 11]]
---
      <div class="img-box">
        <img class="img-sport <% if !@user_sport.where(sport_id: sport.id).present? %> opacity <% end %>" src='<%= image_path("sports/#{sport.image}")%>' value="<%= sport.id %>" alt="">