app/views/aditional_data/_steps_progress.html.erb

  })
  $('.step2').click(function(){
    _sports = <%= current_user.sports.count %>
    if(_sports > 0){
      $.ajax({
        type: "POST",
        url: '<%= choose_sports_aditional_data_path %>',
        data: { action_sender: '<%= @action %>' },
        dataType: "script",
        }).done(function(){
          $('.step1, .step3').removeClass('current')
          $('.step2, .step3').removeClass('visited')
          $('.step2').addClass('current')
      });
    }
  })
---
SELECT COUNT(*) FROM "sports" INNER JOIN "user_sports" ON "sports"."id" = "user_sports"."sport_id" WHERE "user_sports"."user_id" = ?  [["user_id", 1]]