app/controllers/aditional_data_controller.rb

  def steps
    redirect_to dashboard_pages_path if current_user.config? && @action != 'edit_profile'
    @sports = Sport.left_outer_joins(:user_sports).distinct
                   .select('sports.*, user_sports.expertice').group('id')
    @user_sport = UserSport.where(user_id: current_user.id)
---
SELECT DISTINCT sports.*, user_sports.expertice FROM "sports" LEFT OUTER JOIN "user_sports" ON "user_sports"."sport_id" = "sports"."id" GROUP BY "sports"."id"
SELECT "user_sports".* FROM "user_sports" WHERE "user_sports"."user_id" = ? AND "user_sports"."sport_id" = ?  [["user_id", 11], ["sport_id", 11]]

  def choose_sports
    sports = params['sports']
    UserSport.create_or_update(sports, current_user.id) if sports.present?
---
INSERT INTO "user_sports" ("user_id", "sport_id", "created_at", "updated_at", "expertice") VALUES (?, ?, ?, ?, ?)  [["user_id", 12], ["sport_id", 11], ["created_at", "2018-04-17 01:43:33.455031"], ["updated_at", "2018-04-17 01:43:33.455031"], ["expertice", 5]]
SELECT "user_sports".* FROM "user_sports" WHERE "user_sports"."user_id" = ? AND "user_sports"."sport_id" = ?  [["user_id", 12], ["sport_id", 11]]

  def choose_gender_and_age
    @user = User.find(current_user.id)
    @user.update(gender: params['gender'].to_i, age: params['age'].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "gender" = ?, "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["gender", 0], ["age", 33], ["updated_at", "2018-04-17 01:43:46.595750"], ["id", 12]]

  def choose_disponibility
    add_disponibilities(params['disponibilities']) if params['disponibilities'].present?
    @disponibilities = current_user.disponibilities
    @sports = current_user.sports
    current_user.config = true
    current_user.save
---
INSERT INTO "disponibilities" ("day", "afternoon", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["day", 1], ["afternoon", 1], ["user_id", 12], ["created_at", "2018-04-17 01:46:07.902041"], ["updated_at", "2018-04-17 01:46:07.902041"]]
UPDATE "users" SET "config" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["config", "t"], ["updated_at", "2018-04-17 01:44:49.251469"], ["id", 12]]