app/controllers/geocoder_controller.rb

UPDATE "users" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["latitude", -33.420324199999996], ["longitude", -70.6175718], ["updated_at", "2018-04-06 13:54:40.450963"], ["id", 1]]
---
  def findaddress
    @address = Geocoder.address([params[:latitude], params[:longitude]])
    current_user.latitude = params[:latitude]
    current_user.longitude = params[:longitude]
    current_user.save