app/controllers/invitations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def invite_users
    users = params['users']
    @sport = params['sport']
    @users = User.where(id: users)