app/controllers/pages_controller.rb

  def react
    @sports = Sport.all
---
SELECT "sports".* FROM "sports"

  def dashboard
    redirect_to steps_aditional_data_path unless current_user.config?
    age_from = params['ageRange'].present? ? params['ageRange'][0].to_i : current_user.age - 7
    age_to = params['ageRange'].present? ? params['ageRange'][1].to_i : current_user.age + 7
    km = params['km'].present? ? params['km'].to_i : 20
    if params['sports'].present?
      sports = params['sports'].permit!.to_h.map { |key, _value| key.to_i }.join(', ')
    else
      sports = current_user.sports.pluck(:sport_id).map(&:inspect).join(', ')
    end
    gender = params['gender'].present? ? params['gender'] : current_user.gender
    users = User.left_outer_joins(:user_sports).distinct.select('users.*')
                .where("user_sports.sport_id in (#{sports})")
    @@sports = Sport.where("id in (#{sports})")
    @users = users.near([-33.440191, -70.658969],
                        km, units: :km)
                  .where(gender: gender).where('age >= ?', age_from)
                  .where('age <= ?', age_to)
                  .where.not(id: current_user)
---
SELECT "sport_id" FROM "sports" INNER JOIN "user_sports" ON "sports"."id" = "user_sports"."sport_id" WHERE "user_sports"."user_id" = ?  [["user_id", 12]]
SELECT "sports".* FROM "sports" INNER JOIN "user_sports" ON "sports"."id" = "user_sports"."sport_id" WHERE "user_sports"."user_id" = ? AND "sports"."id" IN (SELECT "sports"."id" FROM "sports" INNER JOIN "user_sports" ON "sports"."id" = "user_sports"."sport_id" WHERE "user_sports"."user_id" = ?)  [["user_id", 12], ["user_id", 12]]
SELECT DISTINCT users.*, users.*, (111.19492664455873 * ABS(users.latitude - -33.440191) * 0.7071067811865475) + (96.29763124613503 * ABS(users.longitude - -70.658969) * 0.7071067811865475) AS distance, CASE WHEN (users.latitude >= -33.440191 AND users.longitude >= -70.658969) THEN  45.0 WHEN (users.latitude <  -33.440191 AND users.longitude >= -70.658969) THEN 135.0 WHEN (users.latitude <  -33.440191 AND users.longitude <  -70.658969) THEN 225.0 WHEN (users.latitude >= -33.440191 AND users.longitude <  -70.658969) THEN 315.0 END AS bearing FROM "users" LEFT OUTER JOIN "user_sports" ON "user_sports"."user_id" = "users"."id" WHERE (user_sports.sport_id in (11, 12)) AND (users.latitude BETWEEN -33.62005532118374 AND -33.260326678816256 AND users.longitude BETWEEN -70.87451437626878 AND -70.44342362373122) AND "users"."gender" = ? AND (age >= 26) AND (age <= 40) AND ("users"."id" != 12) ORDER BY distance ASC  [["gender", 0]]

  def searched_users
    users_id = []
    if params['users'].present?
      params['users'].each do |_key, value|
        users_id.push(value['id'])
      end
    end
    @users = User.where(id: users_id)
---
SELECT "users"."id" FROM "users" WHERE 1=0
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def edit_profile
    if request.post?
      current_user.image = params['image'] if params['image'].present?
      current_user.save
    end
    @sports = Sport.left_outer_joins(:user_sports).distinct
                   .select('sports.*, user_sports.expertice').group('id')
    @user_sport = UserSport.where(user_id: current_user.id)
---
UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "pp.jpeg"], ["updated_at", "2018-04-17 01:47:14.053180"], ["id", 12]]
SELECT DISTINCT sports.*, user_sports.expertice FROM "sports" LEFT OUTER JOIN "user_sports" ON "user_sports"."sport_id" = "sports"."id" GROUP BY "sports"."id"
SELECT "user_sports".* FROM "user_sports" WHERE "user_sports"."user_id" = ? AND "user_sports"."sport_id" = ?  [["user_id", 12], ["sport_id", 11]]